tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

InjectionModel  ReactingMultiphaseLookupTableInjection;

DragModel       SphereDrag;

DispersionModel none;

PatchInteractionModel LocalInteraction;

HeatTransferModel RanzMarshall;

CompositionModel SingleMixtureFraction;

PhaseChangeModel LiquidEvaporation;

PostProcessingModel PatchPostProcessing;

DevolatilisationModel none;

SurfaceReactionModel none;

radiation       off;

coupled         true;

cellValueSourceCorrection on;

parcelTypeId    1;

constantProperties
{
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 1e-15;
    TMin            TMin [ 0 0 0 1 0 ] 200;
    pMin            pMin [ 1 -1 2 0 0 ] 1000;
    rho0            rho0 [ 1 -3 0 0 0 ] 1000;
    minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;
    T0              T0 [ 0 0 0 1 0 ] 300;
    cp0             cp0 [ 0 2 -2 -1 0 ] 4100;
    epsilon0        epsilon0 [ 0 0 0 0 0 ] 1;
    f0              f0 [ 0 0 0 0 0 ] 0.5;
    Pr              Pr [ 0 0 0 0 0 ] 0.7;
    Tvap            Tvap [ 0 0 0 1 0 ] 273;
    Tbp             Tvap [ 0 0 0 1 0 ] 373;
    LDevol          LDevol [ 0 0 0 0 0 ] 0;
    hRetentionCoeff hRetentionCoeff [ 0 0 0 0 0 ] 1;
    constantVolume  false;
}

interpolationSchemes
{
    rho             cell;
    U               cellPointFace;
    mu              cell;
    T               cell;
    Cp              cell;
    p               cell;
}

integrationSchemes
{
    U               Euler;
    T               Analytical;
}

particleForces
{
    gravity         on;
    virtualMass     off;
    pressureGradient off;
}

ManualInjectionCoeffs
{
    massTotal       massTotal [ 1 0 0 0 0 ] 1e-3;
    parcelBasisType mass;
    SOI             0.5;
    positionsFile   "reactingCloud1Positions";
    U0              ( 0 0 0 );
    parcelPDF
    {
        pdfType         uniform;
        uniformPDF
        {
            minValue        1e-04;
            maxValue        1e-04;
        }
    }
}

ReactingMultiphaseLookupTableInjectionCoeffs
{
    massTotal       massTotal [ 1 0 0 0 0 ] 1e-2;
    parcelBasisType mass;
    SOI             0.5;
    inputFile       "parcelInjectionProperties";
    duration        1.0;
    parcelsPerSecond 250;
}

StandardWallInteractionCoeffs
{
    type            rebound;
}

LocalInteractionCoeffs
{
    patches
    (
        walls
        {
            type    rebound;
        }
        cycLeft
        {
            type    rebound;
        }
    );
}

RanzMarshallCoeffs
{
    // thermal shielding
    BirdCorrection  true;
}

SingleMixtureFractionCoeffs
{
    phases
    (
        gas
        {
        }
        liquid
        {
            H2O 1;
        }
        solid
        {
        }
    );
    YGasTot0        0;
    YLiquidTot0     1;
    YSolidTot0      0;
}

LiquidEvaporationCoeffs
{
    enthalpyTransfer enthalpyDifference;

    activeLiquids
    (
        H2O
    );
}

PatchPostProcessingCoeffs
{
    maxStoredParcels 20;

    patches
    (
        cycLeft
    );
}


// ************************************************************************* //
